#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ТаблицаВидовЗаписей() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ВидыЗаписейШтатногоРасписания.Ссылка КАК ВидЗаписи,
	|	ВидыЗаписейШтатногоРасписания.ВидЗанятости,
	|	ВидыЗаписейШтатногоРасписания.УчетСтавок,
	|	ВидыЗаписейШтатногоРасписания.УчетДолжностей,
	|	ВидыЗаписейШтатногоРасписания.Порядок КАК Порядок
	|ИЗ
	|	Справочник.ВидыЗаписейШтатногоРасписания КАК ВидыЗаписейШтатногоРасписания
	|ГДЕ
	|	НЕ ВидыЗаписейШтатногоРасписания.ЭтоГруппа
	|	И НЕ ВидыЗаписейШтатногоРасписания.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок");
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();

КонецФункции

Процедура НастроитьСправочник() Экспорт
	
	Объект = ШтатныеПреподаватели.ПолучитьОбъект();
	Объект.ВидЗанятости = Перечисления.ВидыЗанятости.Основное;
	Объект.УчетСтавок = Истина;
	Объект.УчетДолжностей = Истина;
	Объект.Порядок = 1;
	Объект.Записать();
	
	Объект = СовместителиВнешние.ПолучитьОбъект();
	Объект.ВидЗанятости = Перечисления.ВидыЗанятости.ВнешнееСовместительство;
	Объект.УчетСтавок = Истина;
	Объект.УчетДолжностей = Истина;
	Объект.Порядок = 2;
	Объект.Записать();
	
	Объект = СовместителиВнутренние.ПолучитьОбъект();
	Объект.ВидЗанятости = Перечисления.ВидыЗанятости.ВнутреннееСовместительство;
	Объект.УчетСтавок = Истина;
	Объект.УчетДолжностей = Истина;
	Объект.Порядок = 3;
	Объект.Записать();
	
	Объект = ПочасоваяОплатаБезДОТ.ПолучитьОбъект();
	Объект.ВидЗанятости = Перечисления.ВидыЗанятости.Почасовое;
	Объект.УчетСтавок = Ложь;
	Объект.УчетДолжностей = Истина;
	Объект.Порядок = 4;
	Объект.Записать();
	
	Объект = ПочасоваяОплатаДОТ.ПолучитьОбъект();
	Объект.ВидЗанятости = Перечисления.ВидыЗанятости.Почасовое;
	Объект.УчетСтавок = Ложь;
	Объект.УчетДолжностей = Истина;
	Объект.Порядок = 5;
	Объект.Записать();
	
	Объект = ГИА.ПолучитьОбъект();
	Объект.ВидЗанятости = Перечисления.ВидыЗанятости.ПустаяСсылка();
	Объект.УчетСтавок = Ложь;
	Объект.УчетДолжностей = Ложь;
	Объект.Порядок = 6;
	Объект.Записать();
	
	Объект = ГИААспирантура.ПолучитьОбъект();
	Объект.ВидЗанятости = Перечисления.ВидыЗанятости.ПустаяСсылка();
	Объект.УчетСтавок = Ложь;
	Объект.УчетДолжностей = Ложь;
	Объект.Порядок = 7;
	Объект.Записать();
	
	Объект = ПочасоваяНагрузкаБезДОТ.ПолучитьОбъект();
	Объект.ВидЗанятости = Перечисления.ВидыЗанятости.ПустаяСсылка();
	Объект.УчетСтавок = Ложь;
	Объект.УчетДолжностей = Ложь;
	Объект.Порядок = 8;
	Объект.Записать();
		
	Объект = ДОТ.ПолучитьОбъект();
	Объект.ВидЗанятости = Перечисления.ВидыЗанятости.ПустаяСсылка();
	Объект.УчетСтавок = Ложь;
	Объект.УчетДолжностей = Ложь;
	Объект.Порядок = 9;
	Объект.Записать();
		
	Объект = ГИАДОТ.ПолучитьОбъект();
	Объект.ВидЗанятости = Перечисления.ВидыЗанятости.ПустаяСсылка();
	Объект.УчетСтавок = Ложь;
	Объект.УчетДолжностей = Ложь;
	Объект.Порядок = 10;
	Объект.Записать();
											
КонецПроцедуры

#КонецОбласти

#КонецЕсли
