#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Инициализирует таблицы значений, содержащие данные для движений по регистрам.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
// Параметры:
//  Ссылка - ДокументСсылка.ПроектШтатногоРасписания - ссылка на текущий документ
//  ДополнительныеСвойства - Структура - Структура данных для подсистемы печати
//
Процедура ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства) Экспорт
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	
	Запрос = Новый Запрос;
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ПроектШтатногоРасписанияНагрузка.Ссылка.Дата,
	|	ПроектШтатногоРасписанияНагрузка.Ссылка.УчебныйГод,
	|	ПроектШтатногоРасписанияНагрузка.Ссылка.Подразделение,
	|	ПроектШтатногоРасписанияНагрузка.Преподаватель,
	|	ПроектШтатногоРасписанияНагрузка.Должность,
	|	ПроектШтатногоРасписанияНагрузка.ВидЗанятости,
	|	ПроектШтатногоРасписанияНагрузка.УченаяСтепень,
	|	ПроектШтатногоРасписанияНагрузка.УченоеЗвание,
	|	ПроектШтатногоРасписанияНагрузка.КоличествоСтавок,
	|	ПроектШтатногоРасписанияНагрузка.КоличествоЧасов,
	|	ПроектШтатногоРасписанияНагрузка.ТолькоЧасыДОТ
	|ПОМЕСТИТЬ ШтатноеРасписание
	|ИЗ
	|	Документ.ПроектШтатногоРасписания.Нагрузка КАК ПроектШтатногоРасписанияНагрузка
	|ГДЕ
	|	ПроектШтатногоРасписанияНагрузка.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШтатноеРасписание.Дата КАК Период,
	|	ШтатноеРасписание.УчебныйГод,
	|	ШтатноеРасписание.Подразделение,
	|	ШтатноеРасписание.Преподаватель,
	|	ШтатноеРасписание.Должность,
	|	ШтатноеРасписание.ВидЗанятости,
	|	ШтатноеРасписание.УченаяСтепень,
	|	ШтатноеРасписание.УченоеЗвание,
	|	ШтатноеРасписание.ТолькоЧасыДОТ,
	|	СУММА(ШтатноеРасписание.КоличествоСтавок) КАК КоличествоСтавок,
	|	СУММА(ШтатноеРасписание.КоличествоЧасов) КАК КоличествоЧасов
	|ИЗ
	|	ШтатноеРасписание КАК ШтатноеРасписание
	|СГРУППИРОВАТЬ ПО
	|	ШтатноеРасписание.УчебныйГод,
	|	ШтатноеРасписание.Подразделение,
	|	ШтатноеРасписание.Преподаватель,
	|	ШтатноеРасписание.Должность,
	|	ШтатноеРасписание.ВидЗанятости,
	|	ШтатноеРасписание.УченаяСтепень,
	|	ШтатноеРасписание.УченоеЗвание,
	|	ШтатноеРасписание.Дата,
	|	ШтатноеРасписание.ТолькоЧасыДОТ
	|ИМЕЮЩИЕ
	|	СУММА(ШтатноеРасписание.КоличествоСтавок) > 0
	|	ИЛИ СУММА(ШтатноеРасписание.КоличествоЧасов) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ШтатноеРасписание.Дата КАК Период,
	|	ШтатноеРасписание.УчебныйГод,
	|	ШтатноеРасписание.Подразделение,
	|	&Ссылка КАК ШтатноеРасписание
	|ИЗ
	|	ШтатноеРасписание КАК ШтатноеРасписание";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатПакета = Запрос.ВыполнитьПакет();
	ТаблицаШтатноеРасписание = РезультатПакета[1].Выгрузить();
	ТаблицаШтатныеРасписанияПодразделений  = РезультатПакета[2].Выгрузить(); 
	
	ТаблицыДляДвижений.Вставить("ШтатноеРасписание", ТаблицаШтатноеРасписание);
	ТаблицыДляДвижений.Вставить("ШтатныеРасписанияПодразделений", ТаблицаШтатныеРасписанияПодразделений);
	
КонецПроцедуры	

// Находит проект штатного расписания 
//
// Параметры:
//		НаДату - Дата 
//		УчебныйГод - СправочникСсылка.УчебныеГоды 
//		Подразделение - СправочникСсылка.Подразделения
//		ИсключаемыйДокумент - ДокументСсылка.ПроектШтатногоРасписания
//
// Возвращаемое значение:
//		ДокументСсылка.ПроектШтатногоРасписания
Функция НайтиДокумент(НаДату, УчебныйГод, Подразделение, ИсключаемыйДокумент = Неопределено) Экспорт

	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	|	ШтатныеРасписанияПодразделенийСрезПоследних.ШтатноеРасписание
	|ИЗ
	|	РегистрСведений.ШтатныеРасписанияПодразделений.СрезПоследних(&НаДату, УчебныйГод = &УчебныйГод
	|	И Подразделение = &Подразделение
	|	И ШтатноеРасписание <> &ИсключаемыйДокумент) КАК ШтатныеРасписанияПодразделенийСрезПоследних");
	Запрос.УстановитьПараметр("НаДату", НаДату);
	Запрос.УстановитьПараметр("УчебныйГод", УчебныйГод);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("ИсключаемыйДокумент", ИсключаемыйДокумент);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();	
		Выборка.Следующий();
		Возврат Выборка.ШтатноеРасписание;
	КонецЕсли;

КонецФункции

#КонецОбласти

#КонецЕсли