#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если КадроваяСтруктураКлиентСервер.ДляРолиОтветственногоЛицаДоступноПодразделение(Запись.Роль)
		И Не ЗначениеЗаполнено(Запись.Подразделение) Тогда
			ТекстОшибки = СтрШаблон(
				"Для роли '%1' обязательно заполнение подразделения", 
				Запись.Роль);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,,, Отказ);	
		КонецЕсли;
		
		Если Не КадроваяСтруктураКлиентСервер.ДляРолиОтветственногоЛицаДоступноПодразделение(Запись.Роль) 
		И ЗначениеЗаполнено(Запись.Подразделение) Тогда
			ТекстОшибки = СтрШаблон(
				"Для роли '%1' запрещен выбор подразделения", 
				Запись.Роль);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,,, Отказ);	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли