#Область ПрограммныйИнтерфейс

Функция ПоВидуЗанятостиВозможенУчетЧасовДОТ(ВидЗанятости) Экспорт
	Возврат ВидЗанятости = ПредопределенноеЗначение("Перечисление.ВидыЗанятости.Почасовое");
КонецФункции

Функция ПоВидуЗанятостиВозможенУчетСтавок(ВидЗанятости) Экспорт
	Возврат Не ВидыЗанятостиСВозможностьюУчетаСтавок().НайтиПоЗначению(ВидЗанятости) = Неопределено;
КонецФункции

Функция ВидыЗанятостиСВозможностьюУчетаСтавок() Экспорт
	Список = Новый СписокЗначений();
	Список.Добавить(ПредопределенноеЗначение("Перечисление.ВидыЗанятости.Основное"));
	Список.Добавить(ПредопределенноеЗначение("Перечисление.ВидыЗанятости.ВнешнееСовместительство"));
	Список.Добавить(ПредопределенноеЗначение("Перечисление.ВидыЗанятости.ВнутреннееСовместительство"));
	Возврат Список;
КонецФункции

#КонецОбласти