#Область ПрограммныйИнтерфейс

Функция ОпределитьВидЗаписиПоВидуЗанятости(ВидЗанятости) Экспорт
	
	Если ВидЗанятости = ПредопределенноеЗначение("Перечисление.ВидыЗанятости.Основное") Тогда
		Возврат ПредопределенноеЗначение("Справочник.ВидыЗаписейШтатногоРасписания.ШтатныеПреподаватели");
	ИначеЕсли ВидЗанятости = ПредопределенноеЗначение("Перечисление.ВидыЗанятости.ВнешнееСовместительство") Тогда
		Возврат ПредопределенноеЗначение("Справочник.ВидыЗаписейШтатногоРасписания.СовместителиВнешние");
	ИначеЕсли ВидЗанятости = ПредопределенноеЗначение("Перечисление.ВидыЗанятости.ВнутреннееСовместительство") Тогда
		Возврат ПредопределенноеЗначение("Справочник.ВидыЗаписейШтатногоРасписания.СовместителиВнутренние");
	ИначеЕсли ВидЗанятости = ПредопределенноеЗначение("Перечисление.ВидыЗанятости.Почасовое") Тогда
		Возврат ПредопределенноеЗначение("Справочник.ВидыЗаписейШтатногоРасписания.ПочасоваяОплатаБезДОТ");
	КонецЕсли;
	
КонецФункции

#КонецОбласти