#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СформироватьДвиженияНормаУчебнойНагрузки();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвиженияНормаУчебнойНагрузки()
	
	Движения.НормаУчебнойНагрузки.Записывать = Истина;
	
	Для Каждого СтрокаТаблицы Из Должности Цикл
		Запись = Движения.НормаУчебнойНагрузки.Добавить();	
		Запись.Период = Дата;
		ЗаполнитьЗначенияСвойств(Запись, СтрокаТаблицы);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли