#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	НаДату = ТекущаяДатаСеанса();
	
	Если ЗначениеЗаполнено(Параметры.Дата) Тогда
		НаДату = Параметры.Дата;	
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Параметры.Подразделение) Тогда
		Подразделение = Параметры.Подразделение;	
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Параметры.ВидЗанятости) Тогда
		ВидЗанятости = Параметры.ВидЗанятости;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьПараметрыСписка();
	УстановитьОтборыСписка();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаДатуПриИзменении(Элемент)
	УстановитьПараметрыСписка();
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеОтборПриИзменении(Элемент)
	УстановитьОтборыСписка();
КонецПроцедуры

&НаКлиенте
Процедура ВидЗанятостиОтборПриИзменении(Элемент)
	УстановитьОтборыСписка();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьПараметрыСписка()
	Список.Параметры.УстановитьЗначениеПараметра("ДатаСреза", НаДату);			
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборыСписка()
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Подразделение", Подразделение,,, 
		ЗначениеЗаполнено(Подразделение));	
		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ВидЗанятости", ВидЗанятости,,, 
		ЗначениеЗаполнено(ВидЗанятости));	
КонецПроцедуры

#КонецОбласти
