#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	Объект.ДатаОкончания = ДобавитьМесяц(Объект.ДатаНачала, 12) - 1;	
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СформироватьНаименование()
	Объект.Наименование = СтрШаблон("%1/%2", 
		Формат(Объект.ДатаНачала, "ДФ=yyyy; ДП=______;"), 
		Формат(Объект.ДатаОкончания, "ДФ=yyyy; ДП=______;"));
КонецПроцедуры

#КонецОбласти